//******************************************************************************
//* 頂点シェーダー(座標)
//******************************************************************************
var shader_p_vs = `
	attribute vec3 position;
	uniform mat4 mvpMatrix;
	void main(void){
		gl_Position = mvpMatrix * vec4(position, 1.0);
	}
`;

//******************************************************************************
//* フラグメントシェーダー(色固定)
//******************************************************************************
var shader_p_fs = `
	precision mediump float;
	void main(void){
		gl_FragColor = vec4(1.0, 1.0, 1.0, 1.0);
	}
`;
